Data Loading

In [ ]:
import pandas as pd
import os

In [3]:
file_path = "Chocolate Sales.csv"
df = pd.read_csv(file_path)
df.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   object
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: int64(1), object(5)
memory usage: 51.4+ KB

In [4]:
df_cleaned = df.copy()

Deep Validation

In [22]:
print(df_cleaned.isna().sum())

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [23]:
duplicate_rows = df_cleaned.duplicated().sum()
print(f"Number of duplicate rows: {duplicate_rows}")

Number of duplicate rows: 0

Data Prepration

1. Sales Person

In [10]:
#remove extra spaces from 'Sales Person' column
df_cleaned['Sales Person'] = df_cleaned['Sales Person'].str.strip()
#capitalize names in 'Sales Person' column
df_cleaned['Sales Person'] = df_cleaned['Sales Person'].str.title()

sales_person_count = df_cleaned['Sales Person'].nunique()
print(f"--- Validating 'Sales Person' Column ---")
print(f"Number of unique sales persons: {sales_person_count}")
print(f"Unique sales person names: {df_cleaned['Sales Person'].unique()}")

--- Validating 'Sales Person' Column ---
Number of unique sales persons: 25
Unique sales person names: ['Jehu Rudeforth' 'Van Tuxwell' 'Gigi Bohling' 'Jan Morforth' 'Oby Sorrel'
 'Gunar Cockshoot' 'Brien Boise' 'Rafaelita Blaksland' 'Barr Faughny'
 'Mallorie Waber' 'Karlen Mccaffrey' "Marney O'Breen" 'Beverie Moffet'
 'Roddy Speechley' 'Curtice Advani' 'Husein Augar' 'Kaine Padly'
 'Dennison Crosswaite' "Wilone O'Kielt" 'Andria Kimpton' 'Kelci Walkden'
 'Camilla Castle' 'Madelene Upcott' 'Dotty Strutley' 'Ches Bonnell']

2. Country

In [ ]:
# extra spaces removal
df_cleaned['Country'] = df_cleaned['Country'].str.strip()
print(f"unique country values : {df_cleaned['Country'].unique()}")
print(f"number of unique countries : {df_cleaned['Country'].nunique()}")

unique country values : ['UK' 'India' 'Australia' 'New Zealand' 'USA' 'Canada']
number of unique countries : 6

3. Product

In [9]:
#remove extra spaces from 'Product' column
df_cleaned['Product'] = df_cleaned['Product'].str.strip()
product_count = df_cleaned['Product'].nunique()

print(f"--- Validating 'Product' Column ---")
print(f"Number of unique products: {product_count}")
print(f"Unique product names: {df_cleaned['Product'].unique()}")

--- Validating 'Product' Column ---
Number of unique products: 22
Unique product names: ['Mint Chip Choco' '85% Dark Bars' 'Peanut Butter Cubes'
 'Smooth Sliky Salty' '99% Dark & Pure' 'After Nines' '50% Dark Bites'
 'Orange Choco' 'Eclairs' 'Drinking Coco' 'Organic Choco Syrup'
 'Milk Bars' 'Spicy Special Slims' 'Fruit & Nut Bars' 'White Choc'
 'Manuka Honey Choco' 'Almond Choco' 'Raspberry Choco'
 'Choco Coated Almonds' "Baker's Choco Chips" 'Caramel Stuffed Bars'
 '70% Dark Bites']

4. Date

In [14]:
df_cleaned['Date'] = pd.to_datetime(df_cleaned['Date'], format='%d-%b-%y', errors='coerce')

In [15]:
# Find the earliest (oldest) sale date
min_date = df_cleaned['Date'].min()
# Find the latest (most recent) sale date
max_date = df_cleaned['Date'].max()

print(f"--- Validating 'Date' Column Range ---")
print(f"Earliest sale date: {min_date}")
print(f"Latest sale date: {max_date}")

--- Validating 'Date' Column Range ---
Earliest sale date: 2022-01-03 00:00:00
Latest sale date: 2022-08-31 00:00:00

5. Amount

In [ ]:
df_cleaned['Amount'] = df_cleaned['Amount'].str.replace(r'[$,]', '', regex=True)
df_cleaned['Amount'] = pd.to_numeric(df_cleaned['Amount'], errors='coerce')

In [19]:
print(df_cleaned['Amount'].describe())

count     1094.000000
mean      5652.308044
std       4102.442014
min          7.000000
25%       2390.500000
50%       4868.500000
75%       8027.250000
max      22050.000000
Name: Amount, dtype: float64

6. Boxes Shipped

In [26]:
print(df_cleaned['Boxes Shipped'].describe())

count    1094.000000
mean      161.797989
std       121.544145
min         1.000000
25%        70.000000
50%       135.000000
75%       228.750000
max       709.000000
Name: Boxes Shipped, dtype: float64

Check Columns After Changes

In [27]:
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   datetime64[ns]
 4   Amount         1094 non-null   int64
 5   Boxes Shipped  1094 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 51.4+ KB

In [ ]:
df_cleaned.to_csv('chocolate_sales_cleaned.csv', index=False)

Connect to PostgreSQL

In [ ]:
from sqlalchemy import create_engine

db_password = 'admin'
db_name = 'chocolate_project'
username = 'postgres'
host = 'localhost'
port = 5432

try:
    engine = create_engine(f'postgresql://{username}:{db_password}@{host}:{port}/{db_name}')
    connection = engine.connect()
    print("Connection to PostgreSQL database established successfully.")
except Exception as e:
    print(f"An error occurred while connecting to the database: {e}")

Connection to PostgreSQL database established successfully.

Write DataFrame to SQL Table

In [30]:
# Define table name
table_name = 'chocolate_sales_data'

try:
    df_cleaned.to_sql(
        name=table_name,
        con=engine,
        if_exists='replace',
        index=False)
    
    print(f"Success! Data was written to the table '{table_name}' successfully.")
    
except Exception as e:
    print(f"An error occurred while writing data to the table: {e}")

Success! Data was written to the table 'chocolate_sales_data' successfully.